import pandas as pd

print('----'*30)
print('Телефонный справочник')

stud_card = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Виктория','Предко','Екатерина','Ольга','Мария'],
        'Фамилия': ['Мельгуй','Анатолий','Литовченко','Мессинг','Пастернак'],
        'Дата рождения' : ['22.07.1998','30.07.2001','01.04.1999','23.02.2002','08.03.2004'],
        'Телефон' : ['7042079','2378495','712075','9485736','3095748']
}
    
sc = pd.DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')
    
print(sc)